package dsa.basic.queue;

import java.util.PriorityQueue;

public class BasicPriorityQueue {

    public static void main(String[] args) {

        PriorityQueue<String> queue = new PriorityQueue<String>();
        // PriorityQueue จะจัดเรียงข้อมูลตามลำดับลำดับความสำคัญของข้อมูล

        queue.add("555");               // index 0 -> value 555
        queue.add("222");               // index 1 -> value 222
        queue.add("333");               // index 2 -> value 333
        queue.add("111");               // index 3 -> value 111
        queue.add("444");               // index 4 -> value 444
        queue.add("777");               // index 5 -> value 777
        queue.add("666");               // index 6 -> value 666

        System.out.println(queue);      // [111, 222, 333, 555, 444, 777, 666]

//        การเปรียบเทียบ "555" กับ "222":
//        ตัวแรกของ "555" คือ '5' (ค่า Unicode: 53)
//        ตัวแรกของ "222" คือ '2' (ค่า Unicode: 50)
//        เนื่องจาก '2' มีค่า Unicode น้อยกว่ '5', "222" จึงถูกจัดไว้ก่อน "555".
//                การเปรียบเทียบ "555" กับ "333":
//        ตัวแรกของ "555" คือ '5' (ค่า Unicode: 53)
//        ตัวแรกของ "333" คือ '3' (ค่า Unicode: 51)
//        เนื่องจาก '3' มีค่า Unicode น้อยกว่า '5', "333" จะถูกจัดไว้ก่อน "555".
//                การเปรียบเทียบ "555" กับ "111":
//        ตัวแรกของ "555" คือ '5' (ค่า Unicode: 53)
//        ตัวแรกของ "111" คือ '1' (ค่า Unicode: 49)
//        เนื่องจาก '1' มีค่า Unicode น้อยกว่า '5', "111" จะถูกจัดไว้ก่อน "555".
//                การเปรียบเทียบ "555" กับ "444":
//        ตัวแรกของ "555" คือ '5' (ค่า Unicode: 53)
//        ตัวแรกของ "444" คือ '4' (ค่า Unicode: 52)
//        เนื่องจาก '4' มีค่า Unicode น้อยกว่า '5', "444" จะถูกจัดไว้ก่อน "555".
//                การเปรียบเทียบ "777" กับ "555":
//        ตัวแรกของ "777" คือ '7' (ค่า Unicode: 55)
//        ตัวแรกของ "555" คือ '5' (ค่า Unicode: 53)
//        เนื่องจาก '5' น้อยกว่า '7', "555" จะอยู่ก่อน "777".
//        5. ลำดับผลลัพธ์ที่ได้:
//        หลังจากเพิ่มค่าทั้งหมดเข้าไปใน PriorityQueue และให้มันจัดเรียงตามลำดับ lexicographical order, ผลลัพธ์ที่ได้จากการพิมพ์ queue จะเป็น:
//          [111, 222, 333, 444, 555, 666, 777]
    }
}
